Revit 2027 API
IFCExternalServiceUIData.GetParentHwnd Method
 return the parent handle
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IntPtr GetParentHwnd()
Public Function GetParentHwnd As IntPtr
public:
IntPtr GetParentHwnd()
member GetParentHwnd : unit -> IntPtr
Return Value
IntPtr
See Also
Reference
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace